[AdventPriestArmor X2ArmorTemplate]
FriendlyName="ADVENT Priest Armor"
FriendlyNamePlural="ADVENT Priest Armors"
BriefSummary="The priests' armor contains advanced psionic technology. It is unclear to us if the users of this armor of truly psionically gifted, or if ADVENT's gene manipulation is at play. This armor is designed to amplify psionic potential, while also offering built in safe-guard mechanisms. I assume the Elders wish to protect their so-called priests."
TacticalText="<Bullet/>The priests' armor contains advanced psionic technology. It is unclear to us if the users of this armor of truly psionically gifted, or if ADVENT's gene manipulation is at play. This armor is designed to amplify psionic potential, while also offering built in safe-guard mechanisms. I assume the Elders wish to protect their so-called priests."


[AdventPriestArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="Deception"
LocLongDescription="ADVENT will be less likely to detect this soldier during initial contact."
LocHelpText="ADVENT will be less likely to detect this soldier during initial contact."
LocFlyOverText="ADVENT will be less likely to detect this soldier during initial contact."
LocPromotionPopupText="<Bullet/> ADVENT will be less likely to detect this soldier during initial contact."


[AdventPriestArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Psionic-Amplification"
LocLongDescription=" The ADVENT Priest' armor offers increased psi potential and an innate sustain protocol."
LocHelpText=" The ADVENT Priest' armor offers increased psi potential and an innate sustain protocol."
LocFlyOverText=" The ADVENT Priest' armor offers increased psi potential and an innate sustain protocol."
LocPromotionPopupText="<Bullet/> The ADVENT Priest' armor offers increased psi potential and an innate sustain protocol."
